[
  {
    "id": "job_1",
    "role": "Manager (Data & Analytics)",
    "company": "PwC Canada LLP",
    "date": "2012 - 2024",
    "logo": "💼",
    "skills": ["Power BI", "Change Management", "Digital Strategy", "SQL"],
    "summary": "Leading data-driven transformation projects and advising senior government leaders while engineering hands-on analytics solutions.",
    "par": {
      "problem": "Public sector and enterprise clients struggled with fragmented data ecosystems, preventing executive visibility into critical operations.",
      "action": "Architected target operating models and deployed advanced Power BI/SSRS dashboards to track customer journeys and workforce performance.",
      "result": "Delivered sustainable digital transformation and aligned technical execution with strategic business objectives for high-stakes government initiatives."
    }
  },
  {
    "id": "job_2",
    "role": "Business Intelligence Developer",
    "company": "Biond Consulting",
    "date": "2011 - 2012",
    "logo": "📊",
    "skills": ["SSIS", "Data Warehousing", "ETL", "SSRS"],
    "summary": "Specialized in end-to-end Microsoft BI solutions, from architecting data warehouses to building robust reporting dashboards.",
    "par": {
      "problem": "Major retail and distribution clients lacked a unified view of their data, hindering their ability to respond to market trends.",
      "action": "Built and optimized complex ETL pipelines using SSIS and architected enterprise-grade data warehouses to integrate disparate source systems.",
      "result": "Successfully transitioned clients to new analytics platforms, significantly strengthening executive decision-making capabilities."
    }
  },
  {
    "id": "job_3",
    "role": "Manager, Data and Analytics",
    "company": "Teleperformance",
    "date": "2005 - 2011",
    "logo": "🌍",
    "skills": ["C# / VB.NET", "SSRS", "SharePoint", "Automation"],
    "summary": "Managed the data and analytics team driving strategy and transformation across international operations.",
    "par": {
      "problem": "International contact centers relied on manual processes that created data latency and operational inefficiencies.",
      "action": "Managed the full SDLC of automated reporting solutions using SSRS, C#, and SharePoint to standardize performance tracking globally.",
      "result": "Implemented automated processes that resulted in significant time and cost savings across multiple departments."
    }
  }
]
